; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-10)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 )
(:init
(on b1 b7)
(ontable b2)
(ontable b3)
(on b4 b5)
(on b5 b10)
(on b6 b8)
(ontable b7)
(on b8 b9)
(ontable b9)
(on b10 b1)
(clear b2)
(clear b3)
(clear b4)
(clear b6)
)
(:goal
(and
(on b1 b9)
(on b2 b3)
(on b3 b4)
(on b6 b8)
(on b7 b6)
(on b8 b2)
(on b10 b1))
)
)

; plan
1. (move-b-to-t b4 b5)
   deleted: (on b4 b5)
   added: (ontable b4) (clear b5)
   goals met: 2 of 7
2. (move-t-to-b b3 b4)
   deleted: (clear b4) (ontable b3)
   added: (on b3 b4)
   goals met: 3 of 7
3. (move-b-to-t b6 b8)
   deleted: (on b6 b8)
   added: (ontable b6) (clear b8)
   goals met: 2 of 7
4. (move-b-to-t b5 b10)
   deleted: (on b5 b10)
   added: (ontable b5) (clear b10)
   goals met: 2 of 7
5. (move-b-to-b b10 b1 b5)
   deleted: (clear b5) (on b10 b1)
   added: (on b10 b5) (clear b1)
   goals met: 1 of 7
6. (move-t-to-b b2 b3)
   deleted: (clear b3) (ontable b2)
   added: (on b2 b3)
   goals met: 2 of 7
7. (move-b-to-b b8 b9 b2)
   deleted: (clear b2) (on b8 b9)
   added: (on b8 b2) (clear b9)
   goals met: 3 of 7
8. (move-b-to-b b1 b7 b9)
   deleted: (clear b9) (on b1 b7)
   added: (on b1 b9) (clear b7)
   goals met: 4 of 7
9. (move-b-to-b b10 b5 b1)
   deleted: (clear b1) (on b10 b5)
   added: (on b10 b1) (clear b5)
   goals met: 5 of 7
10. (move-t-to-b b6 b8)
   deleted: (clear b8) (ontable b6)
   added: (on b6 b8)
   goals met: 6 of 7
11. (move-t-to-b b7 b6)
   deleted: (clear b6) (ontable b7)
   added: (on b7 b6)
   goals met: 7 of 7
